FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32g4.h
/* Copyright 2020 The Chromium OS Authors. All rights reserved.
 * Use of this source code is governed by a BSD-style license that can be
 * found in the LICENSE file.
 */

/**
 * @file
 * @brief Register map for the STM32G4 family of chips
 *
 * This header file should not be included directly.
 * Please include registers.h instead.
 *
 * Known Chip Variants
 * - STM32G431
 */

#ifndef __CROS_EC_REGISTERS_H
#error "This header file should not be included directly."
#endif

/* --- IRQ numbers --- */
#define STM32_IRQ_WWDG             0
#define STM32_IRQ_PVD              1
#define STM32_IRQ_TAMPER_STAMP     2
#define STM32_IRQ_RTC_WAKEUP       3
#define STM32_IRQ_FLASH            4
#define STM32_IRQ_RCC              5
#define STM32_IRQ_EXTI0            6
#define STM32_IRQ_EXTI1            7
#define STM32_IRQ_EXTI2            8
#define STM32_IRQ_EXTI3            9
#define STM32_IRQ_EXTI4           10
#define STM32_IRQ_DMA_CHANNEL_1   11
#define STM32_IRQ_DMA_CHANNEL_2   12
#define STM32_IRQ_DMA_CHANNEL_3   13
#define STM32_IRQ_DMA_CHANNEL_4   14
#define STM32_IRQ_DMA_CHANNEL_5   15
#define STM32_IRQ_DMA_CHANNEL_6   16
#define STM32_IRQ_DMA_CHANNEL_7   17
#define STM32_IRQ_ADC1            18
#define STM32_IRQ_USB_HP          19
#define STM32_IRQ_USB_LP          20
#define STM32_IRQ_FDCAN_IT0       21
#define STM32_IRQ_FDCAN_IT1       22
#define STM32_IRQ_EXTI9_5         23
#define STM32_IRQ_TIM15           24
#define STM32_IRQ_TIM16           25
#define STM32_IRQ_TIM17           26
#define STM32_IRQ_TIM1_CC         27
#define STM32_IRQ_TIM2            28
#define STM32_IRQ_TIM3            29
#define STM32_IRQ_TIM4            30
#define STM32_IRQ_I2C1_EV         31
#define STM32_IRQ_I2C1_ER         32
#define STM32_IRQ_I2C2_EV         33
#define STM32_IRQ_I2C2_ER         34
#define STM32_IRQ_SPI1            35
#define STM32_IRQ_SPI2            36
#define STM32_IRQ_USART1          37
#define STM32_IRQ_USART2          38
#define STM32_IRQ_USART3          39
#define STM32_IRQ_EXTI15_10       40
#define STM32_IRQ_RTC_ALARM       41
#define STM32_IRQ_USB_FS_WAKEUP   42
#define STM32_IRQ_TIM8_BREAK      43
#define STM32_IRQ_TIM8_UP         44
#define STM32_IRQ_TIM8_TRG_COM    45
#define STM32_IRQ_TIM8_CC         46
#define STM32_IRQ_LPTIM1          49
#define STM32_IRQ_SPI3            51
#define STM32_IRQ_USART4          52
#define STM32_IRQ_TIM6_DAC        54
#define STM32_IRQ_TIM7            55
#define STM32_IRQ_DMA2_CHANNEL1   56
#define STM32_IRQ_DMA2_CHANNEL2   57
#define STM32_IRQ_DMA2_CHANNEL3   58
#define STM32_IRQ_DMA2_CHANNEL4   59
#define STM32_IRQ_DMA2_CHANNEL5   60
#define STM32_IRQ_UCPD1           63
#define STM32_IRQ_COMP_1_2_3      64
#define STM32_IRQ_COMP_4          65
#define STM32_IRQ_CRS             75
#define STM32_IRQ_SAI1            76
#define STM32_IRQ_FPU             81
#define STM32_IRQ_RNG             90
#define STM32_IRQ_LPUART          91
#define STM32_IRQ_I2C3_EV         92
#define STM32_IRQ_I2C3_ER         93
#define STM32_IRQ_DMAMUX_OVR      94
#define STM32_IRQ_DMA1_CHANNEL8   96
#define STM32_IRQ_DMA2_CHANNEL6   97
#define STM32_IRQ_DMA2_CHANNEL7   98
#define STM32_IRQ_DMA2_CHANNEL8   99
#define STM32_IRQ_CORDIC          100
#define STM32_IRQ_FMAC            101

/* LPUART gets accessed as UART9 in STM32 uart driver */
#define STM32_IRQ_USART9 STM32_IRQ_LPUART

/* To simplify code generation, define DMA channel 13 - 14 */
#define STM32_IRQ_DMA_CHANNEL_13   STM32_IRQ_DMA2_CHANNEL6
#define STM32_IRQ_DMA_CHANNEL_14   STM32_IRQ_DMA2_CHANNEL7

/* aliases for easier code sharing */
#define STM32_IRQ_I2C1 STM32_IRQ_I2C1_EV
#define STM32_IRQ_I2C2 STM32_IRQ_I2C2_EV
#define STM32_IRQ_I2C3 STM32_IRQ_I2C3_EV

#ifdef CHIP_VARIANT_STM32G431
#define CHIP_VARIANT_STM32G431X
#endif

/* Embedded flash option bytes base address */
#define STM32_OPTB_BASE             0x1FFFC000
#define STM32_OTP_BASE              0x1FFF7800

/* Peripheral base addresses */
#define STM32_PERIPH_BASE           (0x40000000UL)
/* Peripheral memory map */
#define STM32_APB1PERIPH_BASE       (STM32_PERIPH_BASE + 0x00000000UL)
#define STM32_APB2PERIPH_BASE       (STM32_PERIPH_BASE + 0x00010000UL)
#define STM32_AHB1PERIPH_BASE       (STM32_PERIPH_BASE + 0x00020000UL)
#define STM32_AHB2PERIPH_BASE       (STM32_PERIPH_BASE + 0x08000000UL)

/* APB1 peripherals */
#define STM32_APB1PERIPH(offset)    (STM32_APB1PERIPH_BASE + offset)
#define STM32_TIM2_BASE             STM32_APB1PERIPH(0x0000UL)
#define STM32_TIM3_BASE             STM32_APB1PERIPH(0x0400UL)
#define STM32_TIM4_BASE             STM32_APB1PERIPH(0x0800UL)
#define STM32_TIM6_BASE             STM32_APB1PERIPH(0x1000UL)
#define STM32_TIM7_BASE             STM32_APB1PERIPH(0x1400UL)
#define STM32_CRS_BASE              STM32_APB1PERIPH(0x2000UL)
#define STM32_TAMP_BASE             STM32_APB1PERIPH(0x2400UL)
#define STM32_RTC_BASE              STM32_APB1PERIPH(0x2800UL)
#define STM32_WWDG_BASE             STM32_APB1PERIPH(0x2C00UL)
#define STM32_IWDG_BASE             STM32_APB1PERIPH(0x3000UL)
#define STM32_SPI2_BASE             STM32_APB1PERIPH(0x3800UL)
#define STM32_SPI3_BASE             STM32_APB1PERIPH(0x3C00UL)
#define STM32_USART2_BASE           STM32_APB1PERIPH(0x4400UL)
#define STM32_USART3_BASE           STM32_APB1PERIPH(0x4800UL)
#define STM32_UART4_BASE            STM32_APB1PERIPH(0x4C00UL)
#define STM32_I2C1_BASE             STM32_APB1PERIPH(0x5400UL)
#define STM32_I2C2_BASE             STM32_APB1PERIPH(0x5800UL)
/* USB_IP Peripheral Registers base address */
#define STM32_USB_BASE              STM32_APB1PERIPH(0x5C00UL)
/* USB_IP Packet Memory Area base address */
#define STM32_USB_PMAADDR           STM32_APB1PERIPH(0x6000UL)
#define STM32_FDCAN1_BASE           STM32_APB1PERIPH(0x6400UL)
/* FDCAN configuration registers base address */
#define STM32_FDCAN_CONFIG_BASE     STM32_APB1PERIPH(0x6500UL)
#define STM32_PWR_BASE              STM32_APB1PERIPH(0x7000UL)
#define STM32_I2C3_BASE             STM32_APB1PERIPH(0x7800UL)
#define STM32_LPTIM1_BASE           STM32_APB1PERIPH(0x7C00UL)
#define STM32_LPUART1_BASE          STM32_APB1PERIPH(0x8000UL)
/* UART9 is used as link to LPUART in STM32 uart.c implementation */
#define STM32_USART9_BASE           STM32_APB1PERIPH(0x8000UL)
#define STM32_UCPD1_BASE            STM32_APB1PERIPH(0xA000UL)
#define STM32_SRAMCAN_BASE          STM32_APB1PERIPH(0xA400UL)

/* APB2 peripherals */
#define STM32_APB2PERIPH(offset)    (STM32_APB2PERIPH_BASE + offset)
#define STM32_SYSCFG_BASE           STM32_APB2PERIPH(0x0000UL)
#define STM32_VREFBUF_BASE          STM32_APB2PERIPH(0x0030UL)
#define STM32_COMP1_BASE            STM32_APB2PERIPH(0x0200UL)
#define STM32_COMP2_BASE            STM32_APB2PERIPH(0x0204UL)
#define STM32_COMP3_BASE            STM32_APB2PERIPH(0x0208UL)
#define STM32_COMP4_BASE            STM32_APB2PERIPH(0x020CUL)
#define STM32_OPAMP_BASE            STM32_APB2PERIPH(0x0300UL)
#define STM32_OPAMP1_BASE           STM32_APB2PERIPH(0x0300UL)
#define STM32_OPAMP2_BASE           STM32_APB2PERIPH(0x0304UL)
#define STM32_OPAMP3_BASE           STM32_APB2PERIPH(0x0308UL)
#define STM32_EXTI_BASE             STM32_APB2PERIPH(0x0400UL)
#define STM32_TIM1_BASE             STM32_APB2PERIPH(0x2C00UL)
#define STM32_SPI1_BASE             STM32_APB2PERIPH(0x3000UL)
#define STM32_TIM8_BASE             STM32_APB2PERIPH(0x3400UL)
#define STM32_USART1_BASE           STM32_APB2PERIPH(0x3800UL)
#define STM32_TIM15_BASE            STM32_APB2PERIPH(0x4000UL)
#define STM32_TIM16_BASE            STM32_APB2PERIPH(0x4400UL)
#define STM32_TIM17_BASE            STM32_APB2PERIPH(0x4800UL)
#define STM32_SAI1_BASE             STM32_APB2PERIPH(0x5400UL)
#define STM32_SAI1_Block_A_BASE     (SAI1_BASE + 0x0004UL)
#define STM32_SAI1_Block_B_BASE     (SAI1_BASE + 0x0024UL)

/* AHB1 peripherals */
#define STM32_AHB1PERIPH(offset)    (STM32_AHB1PERIPH_BASE + offset)
#define STM32_DMA1_BASE             STM32_AHB1PERIPH(0x0000UL)
#define STM32_DMA2_BASE             STM32_AHB1PERIPH(0x0400UL)
#define STM32_DMAMUX_BASE           STM32_AHB1PERIPH(0x0800UL)
#define STM32_CORDIC_BASE           STM32_AHB1PERIPH(0x0C00UL)
#define STM32_RCC_BASE              STM32_AHB1PERIPH(0x1000UL)
#define STM32_FMAC_BASE             STM32_AHB1PERIPH(0x1400UL)
#define STM32_FLASH_REGS_BASE       STM32_AHB1PERIPH(0x2000UL)
#define STM32_CRC_BASE              STM32_AHB1PERIPH(0x3000UL)

#define STM32_DMA1_CHAN(offset)     (STM32_DMA1_BASE + offset)
#define STM32_DMA1_Channel1_BASE    STM32_DMA1_CHAN(0x0008UL)
#define STM32_DMA1_Channel2_BASE    STM32_DMA1_CHAN(0x001CUL)
#define STM32_DMA1_Channel3_BASE    STM32_DMA1_CHAN(0x0030UL)
#define STM32_DMA1_Channel4_BASE    STM32_DMA1_CHAN(0x0044UL)
#define STM32_DMA1_Channel5_BASE    STM32_DMA1_CHAN(0x0058UL)
#define STM32_DMA1_Channel6_BASE    STM32_DMA1_CHAN(0x006CUL)

#define STM32_DMA2_CHAN(offset)     (STM32_DMA2_BASE + offset)
#define STM32_DMA2_Channel1_BASE    STM32_DMA2_CHAN(0x0008UL)
#define STM32_DMA2_Channel2_BASE    STM32_DMA2_CHAN(0x001CUL)
#define STM32_DMA2_Channel3_BASE    STM32_DMA2_CHAN(0x0030UL)
#define STM32_DMA2_Channel4_BASE    STM32_DMA2_CHAN(0x0044UL)
#define STM32_DMA2_Channel5_BASE    STM32_DMA2_CHAN(0x0058UL)
#define STM32_DMA2_Channel6_BASE    STM32_DMA2_CHAN(0x006CUL)

#define STM32_DMAMUX(offset)          (STM32_DMAMUX_BASE + offset)
#define STM32_DMAMUX_Channel0_BASE    STM32_DMAMUX(0x0000UL)
#define STM32_DMAMUX_Channel1_BASE    STM32_DMAMUX(0x0004UL)
#define STM32_DMAMUX_Channel2_BASE    STM32_DMAMUX(0x0008UL)
#define STM32_DMAMUX_Channel3_BASE    STM32_DMAMUX(0x000CUL)
#define STM32_DMAMUX_Channel4_BASE    STM32_DMAMUX(0x0010UL)
#define STM32_DMAMUX_Channel5_BASE    STM32_DMAMUX(0x0014UL)
#define STM32_DMAMUX_Channel6_BASE    STM32_DMAMUX(0x0020UL)
#define STM32_DMAMUX_Channel7_BASE    STM32_DMAMUX(0x0024UL)
#define STM32_DMAMUX_Channel8_BASE    STM32_DMAMUX(0x0028UL)
#define STM32_DMAMUX_Channel9_BASE    STM32_DMAMUX(0x002CUL)
#define STM32_DMAMUX_Channel10_BASE   STM32_DMAMUX(0x0030UL)
#define STM32_DMAMUX_Channel11_BASE   STM32_DMAMUX(0x0034UL)
#define STM32_DMAMUX_RequestGenerator0_BASE  STM32_DMAMUX(0x0100UL)
#define STM32_DMAMUX_RequestGenerator1_BASE  STM32_DMAMUX(0x0104UL)
#define STM32_DMAMUX_RequestGenerator2_BASE  STM32_DMAMUX(0x0108UL)
#define STM32_DMAMUX_RequestGenerator3_BASE  STM32_DMAMUX(0x010CUL)
#define STM32_DMAMUX_ChannelStatus_BASE      STM32_DMAMUX(0x0080UL)
#define STM32_DMAMUX_RequestGenStatus_BASE   STM32_DMAMUX(0x0140UL)

/* AHB2 peripherals */
#define STM32_AHB2PERIPH(offset)    (STM32_AHB2PERIPH_BASE + offset)
#define STM32_GPIOA_BASE            STM32_AHB2PERIPH(0x0000UL)
#define STM32_GPIOB_BASE            STM32_AHB2PERIPH(0x0400UL)
#define STM32_GPIOC_BASE            STM32_AHB2PERIPH(0x0800UL)
#define STM32_GPIOD_BASE            STM32_AHB2PERIPH(0x0C00UL)
#define STM32_GPIOE_BASE            STM32_AHB2PERIPH(0x1000UL)
#define STM32_GPIOF_BASE            STM32_AHB2PERIPH(0x1400UL)
#define STM32_GPIOG_BASE            STM32_AHB2PERIPH(0x1800UL)
#define STM32_ADC1_BASE             STM32_AHB2PERIPH(0x08000000UL)
#define STM32_ADC2_BASE             STM32_AHB2PERIPH(0x08000100UL)
#define STM32_ADC12_COMMON_BASE     STM32_AHB2PERIPH(0x08000300UL)
#define STM32_DAC_BASE              STM32_AHB2PERIPH(0x08000800UL)
#define STM32_DAC1_BASE             STM32_AHB2PERIPH(0x08000800UL)
#define STM32_DAC3_BASE             STM32_AHB2PERIPH(0x08001000UL)
#define STM32_RNG_BASE              STM32_AHB2PERIPH(0x08060800UL)

#define STM32_UNIQUE_ID_BASE        0x1FFF7590
#define STM32_DBGMCU_BASE           0xE0042000

