FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32g4.h
#ifndef __ASSEMBLER__

/* Register definitions */

/* --- USART --- */
#define STM32_USART_CR1(base)      STM32_USART_REG(base, 0x00)
#define STM32_USART_CR2(base)      STM32_USART_REG(base, 0x04)
#define STM32_USART_CR3(base)      STM32_USART_REG(base, 0x08)
#define STM32_USART_BRR(base)      STM32_USART_REG(base, 0x0C)
#define STM32_USART_GTPR(base)     STM32_USART_REG(base, 0x10)
#define STM32_USART_SR(base)       STM32_USART_REG(base, 0x1C)
#define STM32_USART_RDR(base)      STM32_USART_REG(base, 0x24)
#define STM32_USART_TDR(base)      STM32_USART_REG(base, 0x28)

/* --- USART bit definitions -- */
#define STM32_USART_SR_ORE		BIT(3)
#define STM32_USART_SR_RXNE		BIT(5)
#define STM32_USART_SR_TC		BIT(6)
#define STM32_USART_SR_TXE		BIT(7)

#define STM32_USART_CR1_UE		BIT(0)
#define STM32_USART_CR1_RE		BIT(2)
#define STM32_USART_CR1_TE		BIT(3)
#define STM32_USART_CR1_RXNEIE		BIT(5)
#define STM32_USART_CR1_TCIE		BIT(6)
#define STM32_USART_CR1_TXEIE		BIT(7)
#define STM32_USART_CR1_PS		BIT(9)
#define STM32_USART_CR1_PCE		BIT(10)
#define STM32_USART_CR1_M		BIT(12)
#define STM32_USART_CR1_OVER8		BIT(15)

#define STM32_USART_CR3_EIE		BIT(0)
#define STM32_USART_CR3_DMAR		BIT(6)
#define STM32_USART_CR3_DMAT		BIT(7)
#define STM32_USART_CR3_ONEBIT		BIT(11)


/* --- GPIO --- */
#define STM32_GPIO_MODER(b)     REG32((b) + 0x00)
#define STM32_GPIO_OTYPER(b)    REG16((b) + 0x04)
#define STM32_GPIO_OSPEEDR(b)   REG32((b) + 0x08)
#define STM32_GPIO_PUPDR(b)     REG32((b) + 0x0C)
#define STM32_GPIO_IDR(b)       REG16((b) + 0x10)
#define STM32_GPIO_ODR(b)       REG16((b) + 0x14)
#define STM32_GPIO_BSRR(b)      REG32((b) + 0x18)
#define STM32_GPIO_LCKR(b)      REG32((b) + 0x1C)
#define STM32_GPIO_AFRL(b)      REG32((b) + 0x20)
#define STM32_GPIO_AFRH(b)      REG32((b) + 0x24)

#define GPIO_ALT_SYS                 0x0
#define GPIO_ALT_TIM2                0x1
#define GPIO_ALT_I2C3                0x2
#define GPIO_ALT_TIM9_11             0x3
#define GPIO_ALT_I2C                 0x4
#define GPIO_ALT_SPI                 0x5
#define GPIO_ALT_SPI3                0x6
#define GPIO_ALT_USART               0x7
#define GPIO_ALT_I2C_23              0x9
#define GPIO_ALT_USB                 0xA
#define GPIO_ALT_LCD                 0xB
#define GPIO_ALT_LPUART              0xC
#define GPIO_ALT_SAI1                0xD
#define GPIO_ALT_RI                  0xE
#define GPIO_ALT_EVENTOUT            0xF

/* --- I2C --- */
#define stm32g4_i2c_reg(base, offset) ((uint16_t *)((base) + (offset)))

#define STM32_I2C_CR1(base)            REG32(stm32g4_i2c_reg(base, 0x00))
#define STM32_I2C_CR2(base)            REG32(stm32g4_i2c_reg(base, 0x04))
#define STM32_I2C_OAR1(base)           REG16(stm32g4_i2c_reg(base, 0x08))
#define STM32_I2C_OAR2(base)           REG16(stm32g4_i2c_reg(base, 0x0C))
#define STM32_I2C_TIMINGR(base)        REG32(stm32g4_i2c_reg(base, 0x10))
#define STM32_I2C_TIMEOUTR(base)       REG32(stm32g4_i2c_reg(base, 0x14))
#define STM32_I2C_ISR(base)            REG32(stm32g4_i2c_reg(base, 0x18))
#define STM32_I2C_ICR(base)            REG32(stm32g4_i2c_reg(base, 0x1C))
#define STM32_I2C_PECR(base)           REG32(stm32g4_i2c_reg(base, 0x20))
#define STM32_I2C_RXDR(base)           REG32(stm32g4_i2c_reg(base, 0x24))
#define STM32_I2C_TXDR(base)           REG32(stm32g4_i2c_reg(base, 0x28))

/* --- I2C CR1 Bit Definitions --- */
#define STM32_I2C_CR1_PE            BIT(0)
#define STM32_I2C_CR1_TXIE          BIT(1)
#define STM32_I2C_CR1_RXIE          BIT(2)
#define STM32_I2C_CR1_ADDRIE        BIT(3)
#define STM32_I2C_CR1_NACKIE        BIT(4)
#define STM32_I2C_CR1_STOPIE        BIT(5)
#define STM32_I2C_CR1_ERRIE         BIT(7)
#define STM32_I2C_CR1_WUPEN         BIT(18)

/* --- I2C CR2 Bit Definitions --- */
#define STM32_I2C_CR2_RD_WRN        BIT(10)
#define STM32_I2C_CR2_START         BIT(13)
#define STM32_I2C_CR2_STOP          BIT(14)
#define STM32_I2C_CR2_NACK          BIT(15)
#define STM32_I2C_CR2_RELOAD        BIT(24)
#define STM32_I2C_CR2_AUTOEND       BIT(25)

/* --- I2C ISR Bit Definitions --- */
#define STM32_I2C_ISR_TXE           BIT(0)
#define STM32_I2C_ISR_TXIS          BIT(1)
#define STM32_I2C_ISR_RXNE          BIT(2)
#define STM32_I2C_ISR_ADDR          BIT(3)
#define STM32_I2C_ISR_NACK          BIT(4)
#define STM32_I2C_ISR_STOP          BIT(5)
#define STM32_I2C_ISR_TC            BIT(6)
#define STM32_I2C_ISR_TCR           BIT(7)
#define STM32_I2C_ISR_BERR          BIT(8)
#define STM32_I2C_ISR_ARLO          BIT(9)
#define STM32_I2C_ISR_OVR           BIT(10)
#define STM32_I2C_ISR_PECERR        BIT(11)
#define STM32_I2C_ISR_TIMEOUT       BIT(12)
#define STM32_I2C_ISR_ALERT         BIT(13)
#define STM32_I2C_ISR_BUSY          BIT(15)
#define STM32_I2C_ISR_DIR           BIT(16)

/* --- I2C ICR Bit Definitions --- */
#define STM32_I2C_ICR_ADDRCF        BIT(3)
#define STM32_I2C_ICR_NACKCF        BIT(4)
#define STM32_I2C_ICR_STOPCF        BIT(5)
#define STM32_I2C_ICR_BERRCF        BIT(8)
#define STM32_I2C_ICR_ARLOCF        BIT(9)
#define STM32_I2C_ICR_OVRCF         BIT(10)
#define STM32_I2C_ICR_TIMEOUTCF     BIT(12)
#define STM32_I2C_ICR_ALL           0x3F38

/* --- I2C TIMINGR bit Definitions --- */
#define STM32_I2C_TIMINGR_SCLL_OFF 0
#define STM32_I2C_TIMINGR_SCLH_OFF 8
#define STM32_I2C_TIMINGR_SDADEL_OFF 16
#define STM32_I2C_TIMINGR_SCLDEL_OFF 20
#define STM32_I2C_TIMINGR_PRESC_OFF 28

/* --- Power / Reset / Clocks --- */

#define STM32_RCC_CR                    REG32(STM32_RCC_BASE + 0x00)
#define STM32_RCC_ICSCR                 REG32(STM32_RCC_BASE + 0x04)
#define STM32_RCC_CFGR                  REG32(STM32_RCC_BASE + 0x08)
#define STM32_RCC_PLLCFGR               REG32(STM32_RCC_BASE + 0x0C)
#define STM32_RCC_CIER                  REG32(STM32_RCC_BASE + 0x18)
#define STM32_RCC_CIFR                  REG32(STM32_RCC_BASE + 0x1C)
#define STM32_RCC_CICR                  REG32(STM32_RCC_BASE + 0x20)
#define STM32_RCC_AHB1RSTR              REG32(STM32_RCC_BASE + 0x28)
#define STM32_RCC_AHB2RSTR              REG32(STM32_RCC_BASE + 0x2C)
#define STM32_RCC_AHB3RSTR              REG32(STM32_RCC_BASE + 0x30)
#define STM32_RCC_APB1RSTR              REG32(STM32_RCC_BASE + 0x38)
#define STM32_RCC_APB2RSTR              REG32(STM32_RCC_BASE + 0x40)
#define STM32_RCC_AHB1ENR               REG32(STM32_RCC_BASE + 0x48)
#define STM32_RCC_AHB2ENR               REG32(STM32_RCC_BASE + 0x4C)
#define STM32_RCC_AHB3ENR               REG32(STM32_RCC_BASE + 0x50)
#define STM32_RCC_APB1ENR1              REG32(STM32_RCC_BASE + 0x58)
#define STM32_RCC_APB1ENR2              REG32(STM32_RCC_BASE + 0x5C)
#define STM32_RCC_APB2ENR               REG32(STM32_RCC_BASE + 0x60)
#define STM32_RCC_AHB1SMENR             REG32(STM32_RCC_BASE + 0x68)
#define STM32_RCC_AHB2SMENR             REG32(STM32_RCC_BASE + 0x6C)
#define STM32_RCC_AHB3SMENR             REG32(STM32_RCC_BASE + 0x70)
#define STM32_RCC_APB1SMENR1            REG32(STM32_RCC_BASE + 0x78)
#define STM32_RCC_APB1SMENR2            REG32(STM32_RCC_BASE + 0x7C)
#define STM32_RCC_APB2SMENR             REG32(STM32_RCC_BASE + 0x80)
#define STM32_RCC_CCIPR                 REG32(STM32_RCC_BASE + 0x88)
#define STM32_RCC_BDCR                  REG32(STM32_RCC_BASE + 0x90)
#define STM32_RCC_CSR                   REG32(STM32_RCC_BASE + 0x94)
#define STM32_RCC_CRRCR                 REG32(STM32_RCC_BASE + 0x98)
#define STM32_RCC_CCIPR2                REG32(STM32_RCC_BASE + 0x9C)

#define STM32_RCC_APB1ENR STM32_RCC_APB1ENR1
#define STM32_RCC_AHBENR STM32_RCC_APB1ENR

/* --- RCC CR Bit Definitions --- */
#define STM32_RCC_CR_HSION		BIT(8)
#define STM32_RCC_CR_HSIRDY		BIT(10)
#define STM32_RCC_CR_HSEON		BIT(16)
#define STM32_RCC_CR_HSERDY		BIT(17)
#define STM32_RCC_CR_PLLON		BIT(24)
#define STM32_RCC_CR_PLLRDY		BIT(25)

/* --- RCC PLLCFGR Bit Definitions --- */
#define  PLLCFGR_PLLSRC_OFF		0
#define  PLLCFGR_PLLSRC(val)		(((val) & 0x3) << PLLCFGR_PLLSRC_OFF)
#define  PLLCFGR_PLLSRC_HSI		2
#define  PLLCFGR_PLLSRC_HSE		3
/* PLL Division factor */
#define  PLLCFGR_PLLM_OFF		4
#define  PLLCFGR_PLLM(val)		(((val) & 0x1f) << PLLCFGR_PLLM_OFF)
/* PLL Multiplication factor */
#define  PLLCFGR_PLLN_OFF		8
#define  PLLCFGR_PLLN(val)		(((val) & 0x7f) << PLLCFGR_PLLN_OFF)
#define  PLLCFGR_PLLQ_EN		BIT(20)
#define  PLLCFGR_PLLQ_OFF		21
#define  PLLCFGR_PLLQ(val)		(((val) & 0x3) << PLLCFGR_PLLQ_OFF)
/* System and main CPU clock */
#define  PLLCFGR_PLLR_EN		BIT(24)
#define  PLLCFGR_PLLR_OFF		25
#define  PLLCFGR_PLLR(val)		(((val) & 0x3) << PLLCFGR_PLLR_OFF)
#define  PLLCFGR_PLLP_OFF		27
#define  PLLCFGR_PLLP(val)		(((val) & 0x1f) << PLLCFGR_PLLP_OFF)

/* --- RCC CFGR Bit Definitions --- */
#define STM32_RCC_CFGR_SW_HSI		(1 << 0)
#define STM32_RCC_CFGR_SW_HSE		(2 << 0)
#define STM32_RCC_CFGR_SW_PLL		(3 << 0)
#define STM32_RCC_CFGR_SW_MASK		(3 << 0)
#define STM32_RCC_CFGR_SWS_HSI		(1 << 2)
#define STM32_RCC_CFGR_SWS_HSE		(2 << 2)
#define STM32_RCC_CFGR_SWS_PLL		(3 << 2)
#define STM32_RCC_CFGR_SWS_MASK		(3 << 2)
/* AHB Prescalar: */
#define  CFGR_HPRE_OFF			4
#define  CFGR_HPRE(val)			(((val) & 0xf) << CFGR_HPRE_OFF)
/* APB1 Low Speed Prescalar < 45MHz */
#define  CFGR_PPRE1_OFF			8
#define  CFGR_PPRE1(val)		(((val) & 0x7) << CFGR_PPRE1_OFF)
/* APB2 High Speed Prescalar < 90MHz */
#define  CFGR_PPRE2_OFF			11
#define  CFGR_PPRE2(val)		(((val) & 0x7) << CFGR_PPRE2_OFF)
/* RTC CLock: Must equal 1MHz */
#define  CFGR_RTCPRE_OFF		16
#define  CFGR_RTCPRE(val)		(((val) & 0x1f) << CFGR_RTCPRE_OFF)

/* --- RCC AHB1ENR Bit Definitions --- */
#define STM32_RCC_AHB1ENR_DMA1EN	BIT(0)
#define STM32_RCC_AHB1ENR_DMA2EN	BIT(1)
#define STM32_RCC_AHB1ENR_DMAMUXEN	BIT(2)

/* --- RCC AHB2ENR Bit Definitions --- */
#define STM32_RCC_AHB2ENR_GPIO_PORTA	BIT(0)
#define STM32_RCC_AHB2ENR_GPIO_PORTB	BIT(1)
#define STM32_RCC_AHB2ENR_GPIO_PORTC	BIT(2)
#define STM32_RCC_AHB2ENR_GPIO_PORTD	BIT(3)
#define STM32_RCC_AHB2ENR_GPIO_PORTE	BIT(4)
#define STM32_RCC_AHB2ENR_GPIO_PORTF	BIT(5)
#define STM32_RCC_AHB2ENR_GPIO_PORTG	BIT(6)
#define STM32_RCC_AHB2ENR_GPIOMASK	(0x7f << 0)
#define STM32_RCC_AHB2ENR_ADC12EN	BIT(13)
#define STM32_RCC_APB2ENR_ADC345EN	BIT(14)
#define STM32_RCC_AHB2ENR_RNGEN		BIT(26)

/* --- RCC APB1ENR1 Bit Definitions --- */
#define STM32_RCC_APB1ENR1_TIM2EN                BIT(0)
#define STM32_RCC_APB1ENR1_TIM3EN                BIT(1)
#define STM32_RCC_APB1ENR1_TIM4EN                BIT(2)
#define STM32_RCC_APB1ENR1_TIM5EN                BIT(3)
#define STM32_RCC_APB1ENR1_TIM6EN                BIT(4)
#define STM32_RCC_APB1ENR1_TIM7EN                BIT(5)
#define STM32_RCC_APB1ENR1_WWDGEN                BIT(11)
#define STM32_RCC_APB1ENR1_USART2                BIT(17)
#define STM32_RCC_APB1ENR1_USART3                BIT(18)
#define STM32_RCC_APB1ENR1_UART4                 BIT(19)
#define STM32_RCC_APB1ENR1_UART5                 BIT(20)
#define STM32_RCC_APB1ENR1_I2C1EN                BIT(21)
#define STM32_RCC_APB1ENR1_I2C2EN                BIT(22)
#define STM32_RCC_APB1ENR1_USBEN                 BIT(23)
#define STM32_RCC_APB1ENR1_PWREN                 BIT(28)
#define STM32_RCC_APB1ENR1_I2C3EN                BIT(30)

#define STM32_RCC_PWREN STM32_RCC_APB1ENR1_PWREN

/* --- RCC APB1ENR2 Bit Definitions --- */
#define STM32_RCC_APB1ENR2_LPUART1EN             BIT(0)
#define STM32_RCC_APB1ENR2_I2C4EN                BIT(1)

/* --- RCC APB2ENR Bit Definitions --- */
#define STM32_RCC_APB2ENR_SYSCFGEN	BIT(0)
#define STM32_RCC_APB2ENR_TIM1		BIT(11)
#define STM32_RCC_APB2ENR_SPI1EN	BIT(12)
#define STM32_RCC_APB2ENR_TIM8		BIT(13)
#define STM32_RCC_APB2ENR_USART1        BIT(14)
#define STM32_RCC_APB2ENR_SPI4EN	BIT(15)
#define STM32_RCC_APB2ENR_TIM15	BIT(16)
#define STM32_RCC_APB2ENR_TIM16	BIT(17)
#define STM32_RCC_APB2ENR_TIM17	BIT(18)
#define STM32_RCC_APB2ENR_TIM20	BIT(20)

