FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32g4.h
#define STM32_RCC_PB2_USART1		STM32_RCC_APB2ENR_USART1

/* gpio.c needs STM32_RCC_SYSCFGEN */
#define STM32_RCC_SYSCFGEN STM32_RCC_APB2ENR_SYSCFGEN

/* --- RCC CSR Bit Definitions --- */
#define STM32_RCC_CSR_LSION		BIT(0)
#define STM32_RCC_CSR_LSIRDY		BIT(1)

/* --- RCC CCIPR Bit Definitions --- */
#define STM32_RCC_CCIPR_UART_SYSCLK      0x1
#define STM32_RCC_CCIPR_USART1SEL_MASK   0x3
#define STM32_RCC_CCIPR_USART1SEL_SHIFT  0
#define STM32_RCC_CCIPR_LPUART1SEL_MASK  0x3
#define STM32_RCC_CCIPR_LPUART1SEL_SHIFT 10
#define STM32_RCC_CCIPR_I2C1SEL_MASK     0x3
#define STM32_RCC_CCIPR_I2C1SEL_SHIFT    12
#define STM32_RCC_CCIPR_I2C2SEL_MASK     0x3
#define STM32_RCC_CCIPR_I2C2SEL_SHIFT    14
#define STM32_RCC_CCIPR_I2C3SEL_MASK     0x3
#define STM32_RCC_CCIPR_I2C3SEL_SHIFT    16

#define STM32_RCC_CCIPR2_I2C4SEL_MASK    0x3

#define STM32_RCC_CCIPR_I2CNSEL_MASK     0x3
#define STM32_RCC_CCIPR_I2CNSEL_SHIFT(n) (STM32_RCC_CCIPR_I2C1SEL_SHIFT + n * 2)
#define STM32_RCC_CCIPR_I2CNSEL_HSI      0x2
/* --- RCC CRRCR Bit Definitions */
#define RCC_CRRCR_HSI48O               BIT(0)
#define RCC_CRRCR_HSIRDY               BIT(1)

/* Reset causes definitions */
/*
 * Reset causes in RCC CSR register. The generic names are required
 */
#define STM32_RCC_RESET_CAUSE STM32_RCC_CSR
#define STM32_RCC_CSR_RMVF              BIT(24)
#define STM32_RCC_CSR_BORRS             BIT(25)
#define STM32_RCC_CSR_PIN               BIT(26)
#define STM32_RCC_CSR_POR               BIT(27)
#define STM32_RCC_CSR_SFT               BIT(28)
#define STM32_RCC_CSR_IWDG              BIT(29)
#define STM32_RCC_CSR_WWDG              BIT(30)
#define STM32_RCC_CSR_LPWR              BIT(31)


#define  RESET_CAUSE_WDG                (STM32_RCC_CSR_WWDG | \
					 STM32_RCC_CSR_IWDG)
#define  RESET_CAUSE_SFT                STM32_RCC_CSR_SFT
#define  RESET_CAUSE_POR                STM32_RCC_CSR_POR
#define  RESET_CAUSE_PIN                STM32_RCC_CSR_PIN
#define  RESET_CAUSE_RMVF               STM32_RCC_CSR_RMVF
#define  RESET_CAUSE_OTHER              (STM32_RCC_CSR_LPWR | \
					 STM32_RCC_CSR_BORRS)
/* Power cause in PWR CSR register */
#define STM32_PWR_CR1                   REG32(STM32_PWR_BASE + 0x00)
#define STM32_PWR_CR2                   REG32(STM32_PWR_BASE + 0x04)
#define STM32_PWR_CR3                   REG32(STM32_PWR_BASE + 0x08)
#define STM32_PWR_CR4                   REG32(STM32_PWR_BASE + 0x0C)
#define STM32_PWR_SR1                   REG32(STM32_PWR_BASE + 0x10)
#define STM32_PWR_SR2                   REG32(STM32_PWR_BASE + 0x14)
#define STM32_PWR_SCR                   REG32(STM32_PWR_BASE + 0x18)
#define STM32_PWR_SCR_CSBF              BIT(8)
#define STM32_PWR_SR1_SBF               BIT(8)

#define STM32_PWR_RESET_CAUSE STM32_PWR_SR1
#define  RESET_CAUSE_SBF                STM32_PWR_SR1_SBF
#define STM32_PWR_RESET_CAUSE_CLR STM32_PWR_SCR
#define  RESET_CAUSE_SBF_CLR            STM32_PWR_SCR_CSBF

/* --- System Config Registers --- */
#define STM32_SYSCFG_MEMRMP             REG32(STM32_SYSCFG_BASE + 0x00)
#define STM32_SYSCFG_PMC                REG32(STM32_SYSCFG_BASE + 0x04)
#define STM32_SYSCFG_EXTICR(n)          REG32(STM32_SYSCFG_BASE + 8 + 4 * (n))
#define STM32_SYSCFG_CMPCR              REG32(STM32_SYSCFG_BASE + 0x20)
#define STM32_SYSCFG_CFGR               REG32(STM32_SYSCFG_BASE + 0x2C)

/* --- Watchdogs --- */

/* --- Real-Time Clock --- */
#define STM32_RTC_TR                REG32(STM32_RTC_BASE + 0x00)
#define STM32_RTC_DR                REG32(STM32_RTC_BASE + 0x04)
#define STM32_RTC_SSR               REG32(STM32_RTC_BASE + 0x08)
#define STM32_RTC_ISR               REG32(STM32_RTC_BASE + 0x0C)
#define STM32_RTC_PRER              REG32(STM32_RTC_BASE + 0x10)
#define STM32_RTC_WUTR              REG32(STM32_RTC_BASE + 0x14)
#define STM32_RTC_CR                REG32(STM32_RTC_BASE + 0x18)


#define STM32_RTC_WPR               REG32(STM32_RTC_BASE + 0x24)
#define STM32_RTC_CALR              REG32(STM32_RTC_BASE + 0x28)
#define STM32_RTC_SHIFTR            REG32(STM32_RTC_BASE + 0x2C)
#define STM32_RTC_TSTR              REG32(STM32_RTC_BASE + 0x30)
#define STM32_RTC_TSDR              REG32(STM32_RTC_BASE + 0x34)
#define STM32_RTC_TSSSR             REG32(STM32_RTC_BASE + 0x38)

#define STM32_RTC_ALRMAR            REG32(STM32_RTC_BASE + 0x40)
#define STM32_RTC_ALRMASSR          REG32(STM32_RTC_BASE + 0x44)
#define STM32_RTC_ALRMBR            REG32(STM32_RTC_BASE + 0x48)
#define STM32_RTC_ALRMBSSR          REG32(STM32_RTC_BASE + 0x44)

/* --- RTC CR Bit Definitions --- */
#define STM32_RTC_CR_BYPSHAD        BIT(5)
#define STM32_RTC_CR_ALRAE          BIT(8)
#define STM32_RTC_CR_ALRAIE         BIT(12)
/* --- RTC ICSR Bit Definitions --- */
#define STM32_RTC_ISR_ALRAWF        BIT(0)
#define STM32_RTC_ISR_RSF           BIT(5)
#define STM32_RTC_ISR_INITF         BIT(6)
#define STM32_RTC_ISR_INIT          BIT(7)
#define STM32_RTC_ISR_ALRAF         BIT(8)
/* --- RTC PRER Bit Definitions --- */
#define STM32_RTC_PRER_A_MASK       (0x7f << 16)
#define STM32_RTC_PRER_S_MASK       (0x7fff << 0)


/* --- Tamper and Backup --- */
#define STM32_TAMP_BKPxR(n)         REG32(STM32_TAMP_BASE + 0x100 + 4 * (n))
#define STM32_BKP_DATA(n)           STM32_TAMP_BKPxR(n)
#define STM32_BKP_BYTES             128


/* --- SPI --- */

/* The SPI controller registers */
struct stm32_spi_regs {
	uint16_t cr1;
	uint16_t _pad0;
	uint16_t cr2;
	uint16_t _pad1;
	unsigned sr;
	uint8_t dr;
	uint8_t _pad2;
	uint16_t _pad3;
	unsigned int crcpr;
	unsigned int rxcrcr;
	unsigned int txcrcr;
	unsigned int i2scfgr;
	unsigned int i2spr;
};
/* Must be volatile, or compiler optimizes out repeated accesses */
typedef volatile struct stm32_spi_regs stm32_spi_regs_t;

#define STM32_SPI1_REGS ((stm32_spi_regs_t *)STM32_SPI1_BASE)
#define STM32_SPI2_REGS ((stm32_spi_regs_t *)STM32_SPI2_BASE)
#define STM32_SPI3_REGS ((stm32_spi_regs_t *)STM32_SPI3_BASE)
#define STM32_SPI4_REGS ((stm32_spi_regs_t *)STM32_SPI4_BASE)

#define STM32_SPI_CR1_BIDIMODE		BIT(15)
#define STM32_SPI_CR1_BIDIOE		BIT(14)
#define STM32_SPI_CR1_CRCEN		BIT(13)
#define STM32_SPI_CR1_SSM		BIT(9)
#define STM32_SPI_CR1_SSI		BIT(8)
#define STM32_SPI_CR1_LSBFIRST		BIT(7)
#define STM32_SPI_CR1_SPE		BIT(6)
#define STM32_SPI_CR1_BR_DIV64R		(5 << 3)
#define STM32_SPI_CR1_BR_DIV4R		BIT(3)
#define STM32_SPI_CR1_MSTR		BIT(2)
#define STM32_SPI_CR1_CPOL		BIT(1)
#define STM32_SPI_CR1_CPHA		BIT(0)
#define STM32_SPI_CR2_FRXTH		BIT(12)
#define STM32_SPI_CR2_DATASIZE(n)	(((n) - 1) << 8)
#define STM32_SPI_CR2_TXEIE		BIT(7)
#define STM32_SPI_CR2_RXNEIE		BIT(6)
#define STM32_SPI_CR2_NSSP		BIT(3)
#define STM32_SPI_CR2_SSOE		BIT(2)
#define STM32_SPI_CR2_TXDMAEN		BIT(1)
#define STM32_SPI_CR2_RXDMAEN		BIT(0)

